import Slider from "react-slick";
import SectionTitle from "comp/Common/SectionTitle";
import withPreviewPopup from "comp/HOC/withPreviewPopup";
import Image from "comp/Elements/Image";
import image1 from 'media/reviews/1.jpg';
import image2 from 'media/reviews/2.jpg';
import image3 from 'media/reviews/3.jpg';
import image4 from 'media/reviews/4.jpg';
import image5 from 'media/reviews/5.jpg';
import image6 from 'media/reviews/6.jpg';
import image7 from 'media/reviews/7.png';
import image8 from 'media/reviews/8.jpg';
import image9 from 'media/reviews/9.jpg';
import image10 from 'media/reviews/10.jpg';
import image11 from 'media/reviews/11.png';
import image12 from 'media/reviews/12.jpg';
import image13 from 'media/reviews/13.jpg';
import image14 from 'media/reviews/14.jpg';
import image15 from 'media/reviews/15.jpg';
import image16 from 'media/reviews/16.jpg';

const sliderSettings = {
    dots: true,
    centerMode: false,
    infinite: true,
    arrows: true,
    loop: true,
    autoplay: true,
    autoplaySpeed: 7000,
    slidesToShow: 3,
    slidesToScroll: 1,
    responsive: [
        {
            breakpoint: 767,
            settings: {
                slidesToShow: 1,
                dots: false,
            }
        },
        {
            breakpoint: 1100,
            settings: {
                slidesToShow: 2,
            }
        }
    ]
};

const Items = [
    {
        id: 7,
        imgUrl: image7,
        alt: "7",
        textDescriptionComponent: <>
            <p className="mb-0">🖇😊 Դասընթացին հնչած միտք, որը ամենաշատն է տպավորվել</p>
            <p>HR-ը պատկանում է բիզնեսին,այլ ոչ թե աշխատողին։</p>
            <p className="mb-0">🖇😊 Ո՞ր թեման եք ամենաշատը սիրել</p>
            <p className="mb-0">Հավատացեք բոլոր թեմաներն էլ ունեն իրենց յուրահատկությունը։</p>
            <p>Բոլորն էլ շատ եմ հավանել, քանի որ բոլորից էլ շատ բան եմ սովորել:</p>
            <p className="mb-0">🖇😊 Հիմա ինչո՞վ եք զբաղվում</p>
            <p>Այս պահին նոր-նոր սկսում եմ իմ քայլերը HR-ում, որպես հավաքագրման մասնագետ։</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 1,
        imgUrl: image1,
        alt: "1",
        textDescriptionComponent: <>
            <p className="mb-0">🚀 Ինչու՞ ընտրեցիք Ակտուալը</p>
            <p>👉 Ինչու՞ ընտրել Ակտուալը, որովհետև մեծ հնարավորություններ է տալիս հասնել հաջողության</p>
            <p className="mb-0">🚀 Ի՞նչ տվեց ձեզ դասընթացը</p>
            <p>👉 Դասընթացը տվեց այն հնարավորությունը, որ կադրային գծով մասնագետը դառնա բիզնես գործընկեր</p>
            <p className="mb-0">🚀 Խորհուրդ կտա՞ք այլ մարդկանց գալ Ակտուալի դասընթացներին</p>
            <p>👉 Խորհուրդ եմ տալիս միանշանակ մասնակցել Ակտուալի կազմակերպած դասընթացին, քանի որ նմանը չունեցող դասընթաց է։ Այն ինձ սովորեցրեց քայլել ժամանակին համընթաց</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 2,
        imgUrl: image5,
        alt: "2",
        textDescriptionComponent: <>
            <p className="mb-0">🤍 Մի քանի բառով պատմեք ձեր մասին</p>
            <p>👉 Ես Մերին եմ, աշխատում եմ որպես HR մասնագետ պետական համակարգում, մասնավոր ոլորտ անցնելու համար ընտրել եմ սկսնակների համար դասընթացը՝ ամբողջական պատկերացում կազմելու և գիտելիքնես ավելի ամրապնդելու համար</p>
            <p className="mb-0">🤍 Ինչու՞ ընտրեցիք մեզ</p>
            <p>👉 Ընտրել եմ հենց Ձեզ, քանի որ կարծում եմ՝ շուկայում առաջատարներից եք</p>
            <p className="mb-0">🤍 Ի՞նչ տվեց ձեզ դասընթացը</p>
            <p>👉 Դասընթացը տվեց ավելի հիմնավոր գիտելիքներ և հնարավորություն տվեց խորապես սովորել Մարդակային ռեսուրսների կառավարման առանձնահատկությունները</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 8,
        imgUrl: image8,
        alt: "8",
        textDescriptionComponent: <>
            <p className="mb-0">🖇😊 Դասընթացին հնչած միտք, որն ամենաշատն է տպավորվել</p>
            <p>Կառավարման գերնպատակն է՝ գտնել թույլ կողմերը և ուժեղացնել դրանք:</p>
            <p className="mb-0">🖇😊 Ո՞ր թեման եք ամենաշատը սիրել</p>
            <p>ՄՌ Ռազմավարության մշակում, Հավաքագրում։ Յուրաքանչյուր թեմա յուրովի հետաքրքիր է։</p>
            <p className="mb-0">🖇😊 Հիմա ինչո՞վ եք զբաղվում</p>
            <p>Անգլերեն լեզվի ուսուցում։</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 3,
        imgUrl: image2,
        alt: "3",
        textDescriptionComponent: <>
            <p className="mb-0">🚀 Ինչու՞ ընտրեցիք Ակտուալը</p>
            <p>👉 Ակտուալը Նորն ու այժմեականը լսելու վստահելի հարթակ է</p>
            <p className="mb-0">🚀 Ի՞նչ տվեց ձեզ դասընթացը</p>
            <p>👉 Ոլորտային կիրառելի գիտելիք և հմտություն, նոր կապեր ու լավ ընկերներ</p>
            <p className="mb-0">🚀 Խորհուրդ կտա՞ք այլ մարդկանց գալ Ակտուալի դասընթացներին</p>
            <p>👉 Արդեն խորհուրդ եմ տվել!</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 4,
        imgUrl: image6,
        alt: "4",
        textDescriptionComponent: <>
            <p className="mb-0">🤍 Մի քանի բառով պատմեք ձեր մասին</p>
            <p>👉 Ես Անին եմ, Ավարտել եմ ՀՊՏՀ ֆինանսներ բաժինը,աշխատում եմ ԱԿԲԱ Բանկում</p>
            <p className="mb-0">🤍 Ինչու՞ ընտրեցիք մեզ</p>
            <p>👉 Գրանցվեցի քանի որ օրը և ժամը ինձ շատ հարմար էր</p>
            <p className="mb-0">🤍 Ի՞նչ տվեց ձեզ դասընթացը</p>
            <p>👉 Դասընթացը շատ հետաքրքիր էր, բավական գիտելիք ստացա նոր մասնագիտությամբ՝ որպես սկսնակ աշխատելու համար</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 9,
        imgUrl: image9,
        alt: "9",
        textDescriptionComponent: <>
            <p className="mb-0">🖇😊 Դասընթացին հնչած միտք, որը ամենաշատն է տպավորվել</p>
            <p className="mb-0">Դասընթացի առաջին օրը տիկին Վիրաբյանը մի շատ խորիմաստ միտք արտահայտեց. «Պետք է լինել ոչ թե լավագույնը,այլ` տարբերվող»</p>
            <p>Դասընթացներից հետո ես համոզվեցի,որ Ակտուալը հենց այդպիսին է` տարբերվող</p>
            <p className="mb-0">🖇😊 Ի՞նչ կարծիք ունեք դասընթացի մասին</p>
            <p>Մանրամասն ու բովանդակալից դասեր ենք ունեցել, որի ընթացքում կարծում եմ մեզ տրվել է նախատեսվածից մի բան էլ ավելի շատ գիտելիք</p>
            <p>Շնորհակալ եմ յուրաքանչյուրիս անհատական մոտեցում ցուցաբերելու, Ձեր գիտելիքներն ու հմտությունները լիովին մեզ փոխանցելու համար</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 5,
        imgUrl: image3,
        alt: "5",
        textDescriptionComponent: <>
            <p className="mb-0">🚀 Ինչու՞ ընտրեցիք Ակտուալը</p>
            <p>👉 Ինչու՞ ընտրել Ակտուալը, որովհետև մեծ հնարավորություններ է տալիս հասնել հաջողության</p>
            <p className="mb-0">🚀 Ի՞նչ տվեց ձեզ դասընթացը</p>
            <p>👉 Դասընթացը լինելով բավականին հագեցած` փոխանցեց գործիքակազմ և հմտություններ այն կիրառելու և բիզնեսում հաջողության հասնելու գործում</p>
            <p className="mb-0">🚀 Խորհուրդ կտա՞ք այլ մարդկանց գալ Ակտուալի դասընթացներին</p>
            <p>👉 Ոչ միայն խորհուրդ կտամ մասնակցել, այլև ես ինքս մեծ սիրով կրկին կմասնակցեմ Ակտուալի կողմից անցկացվելիք դասընթացներին</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 6,
        imgUrl: image4,
        alt: "6",
        textDescriptionComponent: <>
            <p className="mb-0">🤍 Մի քանի բառով պատմեք ձեր մասին</p>
            <p>👉 Ես Անուշն եմ, Բրեվիս ընկերության HR բաժնի աշխատակից։ ՄՌԿ փորձառությունս սկսել եմ 2021 թվականից պետական համակարգում։ Ինձ համար մարտահրավերային էր ընտրել ՄՌԿ ոլորտը, քանի որ առաջին մասնագիտությամբ անգլերեն լեզվի մանկավարժ եմ, իսկ երկրորդ մասնագիտությամբ՝ մակրոտնտեսական վերլուծաբան</p>
            <p className="mb-0">🤍 Ինչու՞ ընտրեցիք մեզ</p>
            <p>👉 Ընկերության տնօրինությունը առաջարկեց</p>
            <p className="mb-0">🤍 Ի՞նչ տվեց ձեզ դասընթացը</p>
            <p>👉 Դասընթացը տվեց համակարգված և ամբողջական պատկերացում/գիտելիքներ ՄՌԿ-ի տեսությունից մինչև պրակտիկ կիրառությունը տարբեր ոլորտներում։ Ծանոթացում ՄՌԿ գրեթե բոլոր գործառույթներին և շուկայում ընթացող միտումներին</p>
            <p>🥹 ՀԳ։ Շնորհակալ եմ Ակտուալ կենտրոնին և Լաուրա Վիրաբյանին հետաքրքիր և արդյունավետ դասընթացի համար։ Դեռ կհանդիպենք HR ոլորտում․․․</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 12,
        imgUrl: image12,
        alt: "12",
        textDescriptionComponent: <>
            <p>🥹 Մեր խոսնակներից Անուշիկ Մինասյանը կիսվել է՝ ի՞նչ տվեց նրան The Voice of HR-ը</p>
            <p>😊 The Voice of HR-ի մասին արդեն հասցրել ենք պատմել ձեզ</p>
            <p>📍 Միջոցառման շրջանակներում քննարկեցինք մեր ոլորտում առկա խնդիրները, ինչպես նաև փորձեցինք միասին գտնել այդ խնդիրների լուծումները</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 10,
        imgUrl: image10,
        alt: "10",
        textDescriptionComponent: <>
            <p className="mb-0">🖇😊 Դասընթացին հնչած միտք, որը ամենաշատն է տպավորվել</p>
            <p>Եթե դու չունես փորձ ապա կարող ես գնել այն-ամենահետաքրքիր և տպավորիչ միտքը</p>
            <p className="mb-0">🖇😊 Ո՞ր թեման եք ամենաշատը սիրել</p>
            <p>Բոլոր թեմաները շատ հետաքրքիր էին, բայց ինձ շատ դուր եկավ ՄՌ Ադմինիստրատիվ մաս, ՀՀ աշխատանքային օրենսդրություն</p>
            <p className="mb-0">🖇😊 Հիմա ինչո՞վ եք զբաղվում</p>
            <p>Ներկայումս աշխատում եմ այլ ոլորտում, բայց վստահ եմ, որ իմ ստացած գիտելիքների շնորհիվ կկարողանամ աշխատել Մարդկային ռեսուրսների կառավարման ոլորտում: Առանձնահատուկ շնորհակալություն հավես, դրական և լավ մասնագետ Լաուրա Վիրաբյանին, հագեցած, հետաքրքիր դասընթացի համար</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 15,
        imgUrl: image15,
        alt: "15",
        textDescriptionComponent: <>
            <p>Ողջույն👋 Ես Սիրանուշն եմ՝ 𝗔𝗖𝗧𝗨𝗔𝗟 𝗛𝗥 𝗔𝗚𝗘𝗡𝗖𝗬-ի ավագ 𝗛𝗥 մասնագետ 👩‍💼</p>
            <p>Ես պատրաստ եմ իմ մասնագիտական գիտելիքները և փորձը ներդնելու Ձեր բիզնեսի առջև դրված մարդկային ռեսուրսների կառավարման խնդիրները կարգավորելու համար 🔍</p>
            <p>🤝 Վստահե՛ք Ձեր բիզնեսի առաջընթացն ու նոր և պրոֆեսիոնալ մասնագետների հավաքագրման գործընթացն 𝗔𝗖𝗧𝗨𝗔𝗟 𝗛𝗥 𝗔𝗚𝗘𝗡𝗖𝗬-ին 🚀</p>
            <p>𝗛𝗥 աութսորս ծառայությունների փաթեթներին ծանոթանալու համար գրե՛ք մեր էջին կամ զանգահարե՛ք նշված հեռախոսահամարով 👇</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 13,
        imgUrl: image13,
        alt: "13",
        textDescriptionComponent: <>
            <p>🥹 Մեր խոսնակներից Անի Սարգսյանը կիսվել է՝ ի՞նչ տվեց նրան The Voice of HR-ը</p>
            <p>😊 The Voice of HR-ի մասին արդեն հասցրել ենք պատմել ձեզ</p>
            <p>📍 Միջոցառման շրջանակներում քննարկեցինք մեր ոլորտում առկա խնդիրները, ինչպես նաև փորձեցինք միասին գտնել այդ խնդիրների լուծումները</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 11,
        imgUrl: image11,
        alt: "11",
        textDescriptionComponent: <>
            <p className="mb-0">🖇😊 Դասընթացին հնչած միտք, որը ամենաշատն է տպավորվել</p>
            <p>Մարդիկ ցանկացած կազմակերպության ամենակարևոր ռեսուրսն են: Հենց իրենք են ստեղծում նոր ռեսուրսներ, կուտակում և օգտագործում ֆինանսական ռեսուրսները, վերահսկում որակը: Մարդիկ ունակ են անընդհատ զարգանալու և կատարելագործվելու, նրանց հնարավորություններն անսպառ են՝ այն դեպքում, երբ մնացած բոլոր ռեսուրսները սահմանափակ են</p>
            <p className="mb-0">🖇😊 Ո՞ր թեման եք ամենաշատը սիրել</p>
            <p>Ամենից շատը դուր են եկել ՄՌ ռազմավարության մշակում և հիմնում և ՄՌ ադմինիստրատիվ մաս, ՀՀ աշխատանքային Օրենսդրություն թեմաները</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 16,
        imgUrl: image16,
        alt: "16",
        textDescriptionComponent: <>
            <p>Ողջույն👋 Ես Մոնիկան եմ՝ 𝗔𝗖𝗧𝗨𝗔𝗟 𝗛𝗥 𝗔𝗚𝗘𝗡𝗖𝗬-ի 𝗛𝗥 մասնագետ 👩‍💼</p>
            <p>Ես կօգնեմ Ձեզ ճիշտ ներկայանալ աշխատաշուկայում` որպես գործատու և համալրել Ձեր թիմը նոր ու պրոֆեսիոնալ մասնագետներով 🔍</p>
            <p>🤝 Վստահե՛ք Ձեր բիզնեսի առաջընթացն ու մարդկային ռեսուրսների կառավարման ողջ գործընթացն 𝗔𝗖𝗧𝗨𝗔𝗟 𝗛𝗥 𝗔𝗚𝗘𝗡𝗖𝗬-ին 🚀</p>
            <p>𝗛𝗥 աութսորս ծառայությունների փաթեթներին ծանոթանալու համար գրե՛ք մեր էջին կամ զանգահարե՛ք նշված հեռախոսահամարով 👇</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
    {
        id: 14,
        imgUrl: image14,
        alt: "14",
        textDescriptionComponent: <>
            <p>🥹 Մեր խոսնակներից Աննա Անդրիասյանը կիսվել է՝ ի՞նչ տվեց նրան The Voice of HR-ը</p>
            <p>😊 The Voice of HR-ի մասին արդեն հասցրել ենք պատմել ձեզ</p>
            <p>📍 Միջոցառման շրջանակներում քննարկեցինք մեր ոլորտում առկա խնդիրները, ինչպես նաև փորձեցինք միասին գտնել այդ խնդիրների լուծումները</p>
            <hr />
            <p className="mb-0">📞 Հեռ․ համար՝ 044 303 028</p>
            <p className="mb-0">🌐 Մեր հասցեն՝ Խանջյան 19</p>
        </>,
    },
];

const CourseReviews = ({ openPreviewHandler }) => {

    return (
        <div className="rs-course-reviews rs-featured-news pt-70 pb-70 md-pt-70 md-pb-30 sm-pb-30">
            <div className="container-fluid">
                <SectionTitle
                    sectionClass="sec-title2 text-center"
                    subtitleClass="sub-title uppercase mb-10"
                    subtitle=""
                    titleClass="title mb-40"
                    title="Ակտուալ Հաղորդակցություն"
                />

                <Slider {...sliderSettings}>
                    {
                        Items.map(({ id, imgUrl, alt, textDescriptionComponent }) => (
                            <Image
                                key={id}
                                src={imgUrl} 
                                alt={alt} 
                                className="block d-block w-100 radius-12 b-none border-none coverable" 
                                clickHandler={evt => openPreviewHandler(evt, textDescriptionComponent)}
                                textDescriptionComponent={textDescriptionComponent}
                                isZooming={true}
                            />
                        ))
                    }
                </Slider>
            </div>
        </div>
        
    )
}

const CourseReviewsWithPreview = withPreviewPopup(CourseReviews);

export default CourseReviewsWithPreview;